app/controllers/cinemas_controller.rb

SELECT "cinemas".* FROM "cinemas"
---
  def index
    @cinemas = Cinema.all

SELECT "cinemas".* FROM "cinemas" WHERE "cinemas"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @cinema = Cinema.find(params[:id])

SELECT "cinemas".* FROM "cinemas" WHERE "cinemas"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @cinema = Cinema.find(params[:id])

INSERT INTO "cinemas" ("created_at", "location", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Tue, 05 Mar 2013 10:15:55 UTC +00:00], ["location", "City Center"], ["name", "City Center Cinema"], ["updated_at", Tue, 05 Mar 2013 10:15:55 UTC +00:00]]
---
  def create
    @cinema = Cinema.new(params[:cinema])

    respond_to do |format|
      if @cinema.save

SELECT "cinemas".* FROM "cinemas" WHERE "cinemas"."id" = ? LIMIT 1  [["id", "1"]]
---
  def update
    @cinema = Cinema.find(params[:id])

SELECT "cinemas".* FROM "cinemas" WHERE "cinemas"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "cinemas" WHERE "cinemas"."id" = ?  [["id", 1]]
---
  def destroy
    @cinema = Cinema.find(params[:id])
    @cinema.destroy