app/controllers/movies_controller.rb

  def create
    @movie = Movie.new(params[:movie])

    respond_to do |format|
      if @movie.save
---
INSERT INTO "movies" ("actors", "created_at", "duration", "genre", "summary", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)