app/controllers/shows_controller.rb

SELECT "shows".* FROM "shows"
---
  def index
    @shows = Show.all

SELECT "shows".* FROM "shows" WHERE "shows"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @show = Show.find(params[:id])

INSERT INTO "shows" ("cinema_id", "created_at", "show_date", "show_time", "show_type", "theater_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @show = Show.new(params[:show])

    respond_to do |format|
      if @show.save