app/controllers/theaters_controller.rb

  def index
    @theaters = Theater.all
---
SELECT "theaters".* FROM "theaters"

  def show
    @theater = Theater.find(params[:id])
---
SELECT "theaters".* FROM "theaters" WHERE "theaters"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @theater = Theater.find(params[:id])
---
SELECT "theaters".* FROM "theaters" WHERE "theaters"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @theater = Theater.new(params[:theater])

    respond_to do |format|
      if @theater.save
---
INSERT INTO "theaters" ("cinema_id", "created_at", "theater_number", "updated_at") VALUES (?, ?, ?, ?)  [["cinema_id", 1], ["created_at", Tue, 05 Mar 2013 09:12:17 UTC +00:00], ["theater_number", 2], ["updated_at", Tue, 05 Mar 2013 09:12:17 UTC +00:00]]

  def destroy
    @theater = Theater.find(params[:id])
    @theater.destroy
---
SELECT "theaters".* FROM "theaters" WHERE "theaters"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "theaters" WHERE "theaters"."id" = ?  [["id", 1]]