app/controllers/users_controller.rb

INSERT INTO "users" ("billing_address", "created_at", "creditcard_num", "creditcard_type", "crypted_password", "email", "is_admin", "is_customer", "is_manager", "name", "reward_points", "salt", "security_num", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save