app/views/shows/_form.html.erb

    <%= f.label :cinema_id %><br />
    <%= f.collection_select :cinema_id, Cinema.order(:name), :id, :name, include_blank: true %>
---
SELECT "cinemas".* FROM "cinemas" ORDER BY name