app/views/theaters/_form.html.erb

      <label>Cinema ID</label>
	    <%= select :theater, :cinema_id, Cinema.all.map {|c| [c.name, c.id]}, :include_blank => 'None' %>
---
SELECT "cinemas".* FROM "cinemas"